
&НаСервере
&После("ЗаполнитьВалюты")
// Дополняеть табличную часть списком валют, курс которых загружается с сайта БНБ
//
Процедура БНБ_ЗаполнитьВалюты()
	
	СписокВалют = Объект.СписокВалют;	
	БНБ_ЗагружаемыеВалюты = БНБ_РаботаСКурсамиВалют.БНБ_ЗагружаемыеВалюты();
	
	Для Каждого ЭлементВалюта Из БНБ_ЗагружаемыеВалюты Цикл
		ДобавитьВалютуВСписок(ЭлементВалюта);
	КонецЦикла;
КонецПроцедуры 

&НаСервере
//Откатывает дополнение табличной части, выполненное в процедуре БНБ_ЗаполнитьВалюты().
//
Процедура БНБ_ВосстановитьСписокВалют()
    
	СписокВалют = Объект.СписокВалют;
	СписокВалют.Очистить();
	
	ЗагружаемыеВалюты = РаботаСКурсамиВалют.ЗагружаемыеВалюты();
	
	Для Каждого ЭлементВалюта Из ЗагружаемыеВалюты Цикл
		ДобавитьВалютуВСписок(ЭлементВалюта);
	КонецЦикла;
   	
КонецПроцедуры	
	
&НаКлиенте
&Перед("НачатьЗагрузкуКурсовВалют")
// Вызывает серверную процедуру получения курсов для котируемых к леву валют 
//
Процедура БНБ_НачатьЗагрузкуКурсовВалют()
	
	// Перед загрузкой курсов валют в штатном режиме, выполняем загрузку курсов валют для тех валют, которые квотируются к леву.
	БНБ_СписокВалют = Объект.СписокВалют;   // Передача аргумента Объект.СписокВалют напрямую выбрасывает ошибку
	БНБ_НачатьПолучениеКурсов(БНБ_СписокВалют, Объект.ОкончаниеПериодаЗагрузки, Объект.ОкончаниеПериодаЗагрузки);
	
	// Удалить из списка загружаемых валют валюты, которые не загружаются в штатном режиме
	БНБ_ВосстановитьСписокВалют();
    // Продолжить выполнение стандартной процедуры получения курсов
КонецПроцедуры   

&НаСервере
// Контроллер, отбирающий котируемые к леву валюты и вызывающий для них загрузку курсов
// В качестве параметров принимает:
// 	СписокВалют: 	Структура с ссылками на загружаемые валюты
// 	ДатаНачала: 	Дата, указанная в форме как НачалоПериодаЗагрузки
// 	ДатаОкончания:	Дата, указанная в форме как ОкончаниеПериодаЗагрузки
//
Процедура БНБ_НачатьПолучениеКурсов(СписокВалют, ДатаНачала, ДатаОкончания )
	Для Каждого Валюта из СписокВалют Цикл		
		Если Валюта.Валюта.БНБ_КотироватьКБолгарскомуЛеву Тогда
			БНБ_СкачатьКурсы(Валюта.Валюта, ДатаНачала, ДатаОкончания);	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
// Основная процедура получения курсов для указанной валюты
// В качестве параметров принимает:
// 	Валюта: 		Ссылка на экземпляр справочника Валюты
// 	ДатаНачала: 	Дата, указанная в форме как НачалоПериодаЗагрузки
// 	ДатаОкончания:	Дата, указанная в форме как ОкончаниеПериодаЗагрузки
//
Процедура БНБ_СкачатьКурсы(Валюта, ДатаНачала, ДатаОкончания)  
	// TODO
	// Здесь будет основная процедура получения и сохранения курсов
	Сообщить("Здесь будет выполнена процедура загрузки курсов " + Валюта + " за период с " + ДатаНачала + " по " + ДатаОкончания);	
КонецПроцедуры
	
