// Возвращает валюты, которые должны загружаться с сайта БНБ
//
// Параметры:
//
// Возвращаемое значение:
//   Массив, СправочникСсылка.Валюты - ссылки созданных валют.
//
Функция БНБ_ЗагружаемыеВалюты() Экспорт
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	НЕ Валюты.ПометкаУдаления
	|	И Валюты.БНБ_КотироватьКБолгарскомуЛеву = ИСТИНА";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

//Возвращает список символьных кодов валют, котировки которых доступны на сайте БНБ
//
&НаСервере
Функция БНБ_ДоступныеВалюты() Экспорт
		
	БНБ_ДоступныеВалюты = новый Массив();
	Ответ = БНБ_ПолучитьСтраницуHTML("www.bnb.bg/Statistics/StExternalSector/StExchangeRates/StERForeignCurrencies/index.htm?search=true");
	Если Ответ.Статус Тогда	
		ЧтениеHTML = Новый ЧтениеHTML;
		ЧтениеHTML.УстановитьСтроку(Ответ.Результат);
		ПостроительДОМ = Новый ПостроительDOM;
		ДокументDOM= ПостроительДОМ.Прочитать(ЧтениеHTML);
		ЭлементыСекции = ДокументDOM.ПолучитьЭлементПоИдентификатору("currency").ДочерниеУзлы[4].ДочерниеУзлы;	
		
		Для каждого Валюта Из ЭлементыСекции Цикл		
			БНБ_ДоступныеВалюты.Добавить(Валюта.ТекстовоеСодержимое)		
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат БНБ_ДоступныеВалюты;	

КонецФункции  

//Возвращает структуру "Статус,Результат" где
// Статус - результат получения страницы
// Результат - текстовое содержимое полученной HTML-страницы
//
&НаСервере
Функция БНБ_ПолучитьСтраницуHTML(АдресСтраницы) Экспорт 
	Результат = Новый Структура("Статус,Результат");	
	
	Если СтрДлина(АдресСтраницы) = 0 Тогда
		Результат.Вставить("Статус",Ложь);
		Результат.Вставить("Результат","Не указан адрес страницы");
		Возврат Результат;
	КонецЕсли;
	
	Попытка	
		БезопасноеСоединение = Новый HTTPСоединение(Лев(АдресСтраницы, СтрНайти(АдресСтраницы, "/")-1),443,,,,,Новый ЗащищенноеСоединениеOpenSSL());	
		ТекстЗапроса = Прав(АдресСтраницы, 1 + (СтрДлина(АдресСтраницы) - СтрНайти(АдресСтраницы, "/")));	
		HTMLОтвет = БезопасноеСоединение.Получить(Новый HTTPЗапрос(ТекстЗапроса));	
	Исключение
		Результат.Вставить("Статус", ложь);
		Возврат Результат;
	КонецПопытки;
	
	
	Если HTMLОтвет.КодСостояния = 200 Тогда
		//В случае успеха вернуть содержимое страницы
		Результат.Вставить("Статус",Истина);		
		Результат.Вставить("Результат", HTMLОтвет.ПолучитьТелоКакСтроку());	
		
	Иначе
		//В случае ошибки вернуть код ошибки
		Результат.Вставить("Статус",Ложь);
		Результат.Вставить("Результат",  HTMLОтвет.КодСостояния);
		
	КонецЕсли;
	
	Возврат Результат;
	

КонецФункции