// Получает управление при выполнении регламентного задания
// Запускает РаботаСКурсамиВалют.БНБ_ОбновитьАвтоматическиЗагружаемые() и отчитывается
// о результате в журнал регистрации
// 
&Перед("ЗагрузитьАктуальныйКурс")
Процедура БНБ_ЗагрузитьАктуальныйКурс(ПараметрыЗагрузки = Неопределено, АдресРезультата = Неопределено)
	// Записать отметку в журнал  
	ИмяСобытия = ИмяСобытияЖурналаРегистрации();
	ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Начата регламентная загрузка курсов валют для болгарского лева.'"));
		
	Результат = РаботаСКурсамиВалют.БНБ_ОбновитьАвтоматическиЗагружаемые();
	
	Если НЕ Результат.Статус Тогда
		// Сообщить о ошибке
		Описание = НСтр("ru = 'Регламентная загрузка курсов завершена с ошибкой: %1'");
		Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Описание, Результат.Описание);
		ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Ошибка,,,Описание);
	Иначе
		// Отчитатся о окончании
		ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Завершена регламентная загрузка курсов валют для болгарского лева.'"));	
	КонецЕсли;	                                       
				
КонецПроцедуры
