
&Перед("ЗагрузитьАктуальныйКурс")
Процедура БНБ_ЗагрузитьАктуальныйКурс(ПараметрыЗагрузки, АдресРезультата)
	// Записать отметку в журнал 
	ИмяСобытия = ИмяСобытияЖурналаРегистрации();
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
	НСтр("ru = 'Начата регламентная загрузка курсов валют для Болгарского Лева'"));
	
	Результат = РаботаСКурсамиВалют.БНБ_ОбновитьАвтоматическиЗагружаемые();	
	Описание = "ru = '"  + Результат.Описание + "'";	
	
	Если Результат.Статус Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;		
	Иначе
		Уровень = УровеньЖурналаРегистрации.Ошибка;	
	КонецЕсли;	                                       
	
	ЗаписьЖурналаРегистрации(ИмяСобытия,Уровень,,,НСтр(Описание));
	
	// Отчитатся о окончании
	ЗаписьЖурналаРегистрации(
	ИмяСобытия,
	УровеньЖурналаРегистрации.Информация,
	,
	,
	НСтр("ru = 'Завершена регламентная загрузка курсов валют для Болгарского Лева.'"));
	
КонецПроцедуры
